data/Parm_PH_29/alpha_15/alpha_15_10929_4048/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

libs ( "libfrozenIncompressibleTurbulenceModels.so" );

application     simpleFoam;//

startFrom       latestTime;

startTime       0;

stopAt          endTime;//writeNow

endTime         20000;

deltaT          1;

writeControl    timeStep;

writeInterval   4000;

purgeWrite      0;

writeFormat     ascii;

writePrecision  15;

writeCompression uncompressed;

timeFormat      general;

timePrecision   15;

runTimeModifiable yes;//true;

functions
{
  #includeFunc  residuals
  #includeFunc  singleGraph_x0
  #includeFunc  singleGraph_x1
  #includeFunc  singleGraph_x2
  #includeFunc  singleGraph_x3
  #includeFunc  singleGraph_x4
  #includeFunc  singleGraph_x5
  #includeFunc  singleGraph_x6
  #includeFunc  singleGraph_x7
  #includeFunc  singleGraph_x8

}
// ************************************************************************* //
