data/Parm_PH_29/alpha_15/alpha_15_10929_4048/0/C
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      C;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<vector> 
15600
(
(0.0473279108943568 1.00195551652101 -5.71993069776789e-18)
(0.141984855971558 1.00179412474911 9.63601997408321e-20)
(0.236617731419041 0.999549105227584 -3.90589923409125e-18)
(0.330985025021903 0.992415181931285 0)
(0.424513866315547 0.97826201975789 1.80843023897702e-18)
(0.516279535932282 0.955435656837957 0)
(0.60558789507108 0.924261969003174 0)
(0.692465025939928 0.886759576761121 9.47250109715604e-20)
...
)
;

boundaryField
{
    bottomWall
    {
        type            calculated;
        value           nonuniform List<vector> 
120
(
(0.0473314189324665 1 0)
(0.141992923364246 0.999838300333132 0)
(0.236603561877925 0.997590266626776 0)
(0.330932724171946 0.990449140020243 0)
(0.424406934768588 0.976286619377568 0)
(0.516109245427258 0.953449575689817 0)
(0.605366821937763 0.922252304940528 0)
(0.69220860346827 0.884706683513606 0)
...
)
;
    }
    topWall
    {
        type            calculated;
        value           nonuniform List<vector> 
120
(
(0.0455375 4.048 0)
(0.1366125 4.048 0)
(0.2276875 4.048 0)
(0.3187625 4.048 0)
(0.4098375 4.048 0)
(0.5009125 4.048 0)
(0.5919875 4.048 0)
(0.6830625 4.048 0)
...
)
;
    }
    inlet_half0
    {
        type            cyclic;
    }
    inlet_half1
    {
        type            cyclic;
    }
    outlet_half0
    {
        type            cyclic;
    }
    outlet_half1
    {
        type            cyclic;
    }
    sideRight_half0
    {
        type            empty;
    }
    sideRight_half1
    {
        type            empty;
    }
    sideLeft_half0
    {
        type            empty;
    }
    sideLeft_half1
    {
        type            empty;
    }
}


// ************************************************************************* //
