data/Parm_PH_29/alpha_15/alpha_15_10929_4048/0/tauij_LES
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volSymmTensorField;
    location    "0";
    object      tauij_LES;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<symmTensor>
15600
(
(0.00427051 -0.00005222 0.00000000 0.00001535 0.00000000 0.00203544)
(0.00508981 -0.00006962 0.00000000 0.00002323 0.00000000 0.00233943)
(0.00362220 -0.00002865 0.00000000 0.00000780 0.00000000 0.00159765)
(0.00034492 -0.00015266 0.00000000 0.00008255 0.00000000 0.00082632)
(0.00032869 0.00001198 0.00000000 -0.00002059 0.00000000 0.00023437)
(0.00050135 0.00001319 0.00000000 -0.00001987 0.00000000 0.00057667)
(0.00039102 -0.00030774 0.00000000 0.00021224 0.00000000 0.00100626)
(0.00028089 -0.00028730 0.00000000 0.00021673 0.00000000 0.00066433)
...
)
;

boundaryField
{
    bottomWall
    {
        type        fixedValue;
        value       uniform (0 0 0 0 0 0);
    }
    topWall
    {
        type        fixedValue;
        value       uniform (0 0 0 0 0 0);
    }
    inlet_half0
    {
        type        cyclic;
    }
    inlet_half1
    {
        type        cyclic;
    }
    outlet_half0
    {
        type        cyclic;
    }
    outlet_half1
    {
        type        cyclic;
    }
    sideRight_half0
    {
        type        empty;
    }
    sideRight_half1
    {
        type        empty;
    }
    sideLeft_half0
    {
        type        empty;
    }
    sideLeft_half1
    {
        type        empty;
    }
}

// ************************************************************************* //
